InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих/Forms/ФормаЗаписиДополнительнаяУправляемая/Ext/Form/Module.bsl
#Область ДействияКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", РегистрСведенийМенеджерЗаписи.ФизЛицо);
	
	ОткрытьФорму("РегистрСведений.бит_ФИОПроживающих.Форма.ФормаСпискаУправляемая", Новый Структура("Отбор", Отбор), ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФизЛицоПриОткрытии  = РегистрСведенийМенеджерЗаписи.ФизЛицо;
	ПериодПриОткрытии   = РегистрСведенийМенеджерЗаписи.Период;
	ФамилияПриОткрытии  = РегистрСведенийМенеджерЗаписи.Фамилия;
	ИмяПриОткрытии      = РегистрСведенийМенеджерЗаписи.Имя;
	ОтчествоПриОткрытии = РегистрСведенийМенеджерЗаписи.Отчество;
	
	Заголовок = "Фамилия, имя, отчество физ. лица: " + ПолучитьНаименованиеФизЛицаНаСервере(РегистрСведенийМенеджерЗаписи.ФизЛицо);
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены измерения и период.
	Если РегистрСведенийМенеджерЗаписи.ФизЛицо = Неопределено ИЛИ Не ЗначениеЗаполнено(РегистрСведенийМенеджерЗаписи.ФизЛицо) Тогда
		
	    РегистрСведенийМенеджерЗаписи.ФизЛицо = ФизЛицоПриОткрытии;
	    РегистрСведенийМенеджерЗаписи.Период  = ПериодПриОткрытии;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если поменяли дату, то тогда новая  запись.
	Если ПериодПриОткрытии <> РегистрСведенийМенеджерЗаписи.Период Тогда
		
		// Если что-то поменяли тогда запишем. 
		Если ФамилияПриОткрытии <> РегистрСведенийМенеджерЗаписи.Фамилия Или
			ИмяПриОткрытии <> РегистрСведенийМенеджерЗаписи.Имя Или
			ОтчествоПриОткрытии <> РегистрСведенийМенеджерЗаписи.Отчество Тогда
		
			МенеджерЗаписи = РегистрыСведений.бит_ФИОПроживающих.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Период   = ПериодПриОткрытии;
			МенеджерЗаписи.ФизЛицо  = РегистрСведенийМенеджерЗаписи.ФизЛицо;
			МенеджерЗаписи.Фамилия  = ФамилияПриОткрытии;
			МенеджерЗаписи.Имя	    = ИмяПриОткрытии;
			МенеджерЗаписи.Отчество = ОтчествоПриОткрытии;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПолучитьНаименованиеФизЛицаНаСервере(Знач ФизЛицо)
	
	Возврат ФизЛицо.Наименование;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "ФИО"), РегистрСведенийМенеджерЗаписи.ФизЛицо);
	
КонецПроцедуры

#КонецОбласти
